---
kind: method
id: M:Autodesk.Revit.DB.MullionTypeSet.GetEnumerator
source: html/b097cf81-33e6-81b3-ade9-d12b961b6e0b.htm
---
# Autodesk.Revit.DB.MullionTypeSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.